Parsing_WSDL/ComparisonJsons/wsdl_temp_conversion.wsdl.json

[{"name":"TempConvert","port":[{"name":"TempConvertSoap","address":"http://www.w3schools.com/xml/tempconvert.asmx","operations":[{"name":"FahrenheitToCelsius","actionUrl":"https://www.w3schools.com/xml/FahrenheitToCelsius","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:FahrenheitToCelsius>\r\n      <tns:Fahrenheit>string</tns:Fahrenheit>\r\n    </tns:FahrenheitToCelsius>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:FahrenheitToCelsiusResponse>\r\n      <tns:FahrenheitToCelsiusResult>string</tns:FahrenheitToCelsiusResult>\r\n    </tns:FahrenheitToCelsiusResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"CelsiusToFahrenheit","actionUrl":"https://www.w3schools.com/xml/CelsiusToFahrenheit","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:CelsiusToFahrenheit>\r\n      <tns:Celsius>string</tns:Celsius>\r\n    </tns:CelsiusToFahrenheit>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:CelsiusToFahrenheitResponse>\r\n      <tns:CelsiusToFahrenheitResult>string</tns:CelsiusToFahrenheitResult>\r\n    </tns:CelsiusToFahrenheitResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"}]},{"name":"TempConvertSoap12","address":"http://www.w3schools.com/xml/tempconvert.asmx","operations":[{"name":"FahrenheitToCelsius","actionUrl":"https://www.w3schools.com/xml/FahrenheitToCelsius","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:FahrenheitToCelsius>\r\n      <tns:Fahrenheit>string</tns:Fahrenheit>\r\n    </tns:FahrenheitToCelsius>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:FahrenheitToCelsiusResponse>\r\n      <tns:FahrenheitToCelsiusResult>string</tns:FahrenheitToCelsiusResult>\r\n    </tns:FahrenheitToCelsiusResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"CelsiusToFahrenheit","actionUrl":"https://www.w3schools.com/xml/CelsiusToFahrenheit","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:CelsiusToFahrenheit>\r\n      <tns:Celsius>string</tns:Celsius>\r\n    </tns:CelsiusToFahrenheit>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:CelsiusToFahrenheitResponse>\r\n      <tns:CelsiusToFahrenheitResult>string</tns:CelsiusToFahrenheitResult>\r\n    </tns:CelsiusToFahrenheitResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"}]},{"name":"TempConvertHttpPost","address":"http://www.w3schools.com/xml/tempconvert.asmx","operations":[{"name":"FahrenheitToCelsius","actionUrl":"http://www.w3schools.com/xml/tempconvert.asmx/FahrenheitToCelsius","input":null,"output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:string>string</tns:string>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[{"Name":"Fahrenheit","Type":"string","DefaultValue":"string","LocationType":4,"IsXml":false}],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"application/x-www-form-urlencoded","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":null,"BodyUse":0,"BodeRequired":false,"BodyEncoding":null,"HttpVerb":"POST"},{"name":"CelsiusToFahrenheit","actionUrl":"http://www.w3schools.com/xml/tempconvert.asmx/CelsiusToFahrenheit","input":null,"output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"https://www.w3schools.com/xml/\">\r\n  <soap:Body>\r\n    <tns:string>string</tns:string>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[{"Name":"Celsius","Type":"string","DefaultValue":"string","LocationType":4,"IsXml":false}],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"application/x-www-form-urlencoded","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":null,"BodyUse":0,"BodeRequired":false,"BodyEncoding":null,"HttpVerb":"POST"}]}]}]